app/views/articles/index.html.erb

SELECT  "articles".* FROM "articles"  ORDER BY "articles"."id" DESC LIMIT 1
SELECT COUNT(*) FROM "articles"
---

<% if Article.all.any? %>