app/controllers/articles_controller.rb

  def index
    @articles = Article.all.includes(:user)
---
SELECT  "articles".* FROM "articles"  ORDER BY "articles"."id" DESC LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 2, 3)

  def create
    @article = Article.new(article_params)
    @article.user = current_user
    if @article.save
---
INSERT INTO "articles" ("title", "text", "photo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "z obrazkiem"], ["text", "z obrazkiem"], ["photo", "Screenshot_from_2015-05-18_23_13_34.png"], ["created_at", "2015-05-18 22:03:06.140297"], ["updated_at", "2015-05-18 22:03:06.140297"]]

  def update
    @article = Article.find(params[:id])
    authorize! :update, @article
    if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "pierwszy artykul"], ["text", "pierwszytextartykulu"], ["updated_at", "2015-05-09 12:45:51.779013"], ["id", 1]]

  def destroy
    @article = Article.find(params[:id])
    authorize! :destroy, @article
    @article.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 229]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 229]]