app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "article_id", "user_id", "commenter", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "sss"], ["article_id", 20], ["user_id", 1], ["commenter", "example"], ["created_at", "2015-05-21 13:28:37.337713"], ["updated_at", "2015-05-21 13:28:37.337713"]]
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.new(comment_params)
    @comment.user = current_user
    @comment.commenter = current_user.email.to_s.split("@")[0].titleize
    @comment.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT 1  [["article_id", 1], ["id", 2]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
---
  def destroy
    @article = Article.find(params[:article_id])
    @comment = @article.comments.find(params[:id])
    if @comment.user != current_user
      flash[:warning] = "You can't delete this!"
      redirect_to(@article)
    else
      @comment.destroy